# **Adding a column**

In [ ]:
import pandas as pd

### Preview Data\nViewing first/last rows of the dataset

In [ ]:
data = {
    'Name': [
        'Alice', 'Bob', 'Charlie', 'David', 'Eve',
        'Frank', 'Grace', 'Hank', 'Ivy', 'Jack',
        'Kathy', 'Leo', 'Mia', 'Noah', 'Olivia',
        'Paul', 'Quinn', 'Rose', 'Sam', 'Tina'
    ],
    'Age': [
        25, 30, 35, 28, 22, 40, 31, 29, 24, 33,
        27, 38, 26, 32, 23, 45, 29, 34, 21, 36
    ],
    'City': [
        'New York', 'San Francisco', 'Los Angeles', 'Chicago', 'Miami',
        'Seattle', 'Austin', 'Boston', 'Denver', 'Atlanta',
        'Portland', 'Dallas', 'Phoenix', 'San Diego', 'Philadelphia',
        'Las Vegas', 'Houston', 'Detroit', 'Minneapolis', 'Nashville'
    ],
    'Salary': [
        50000, 60000, 70000, 55000, 48000,
        85000, 62000, 58000, 52000, 67000,
        54000, 78000, 51000, 64000, 49000,
        95000, 59000, 72000, 47000, 81000
    ]
}

df = pd.DataFrame(data)
print(df.head())

      Name  Age           City  Salary
0    Alice   25       New York   50000
1      Bob   30  San Francisco   60000
2  Charlie   35    Los Angeles   70000
3    David   28        Chicago   55000
4      Eve   22          Miami   48000

## **01- Using Square Brackects**

In [ ]:
# Add Bounus Column
df["Bonus"] = df["Salary"] * 0.1
print(df.head())

      Name  Age           City  Salary   Bonus
0    Alice   25       New York   50000  5000.0
1      Bob   30  San Francisco   60000  6000.0
2  Charlie   35    Los Angeles   70000  7000.0
3    David   28        Chicago   55000  5500.0
4      Eve   22          Miami   48000  4800.0

### Preview Data\nViewing first/last rows of the dataset

In [ ]:
# Add Total Salary (Salary + Bounus)
df["TotalSalary"] = df["Salary"] + df["Bonus"]
print(df.head())

      Name  Age           City  Salary   Bonus  TotalSalary
0    Alice   25       New York   50000  5000.0      55000.0
1      Bob   30  San Francisco   60000  6000.0      66000.0
2  Charlie   35    Los Angeles   70000  7000.0      77000.0
3    David   28        Chicago   55000  5500.0      60500.0
4      Eve   22          Miami   48000  4800.0      52800.0

## **02- Using **`insert()`** method**

In [ ]:
sample_data = {
    'Name': ['John', 'Jane', 'Bob', 'Alice'],
    'Age': [25, 30, 35, 40],
    'City': ['New York', 'San Francisco', 'Los Angeles', 'Chicago']
}
dataFrame = pd.DataFrame(sample_data)
print(dataFrame)

    Name  Age           City
0   John   25       New York
1   Jane   30  San Francisco
2    Bob   35    Los Angeles
3  Alice   40        Chicago

### Insert Column\nAdding new column at specific position

In [ ]:
# I want to add ID Column at first
emp_id = [101, 102, 103, 104]
dataFrame.insert(0, 'EmpID', emp_id)
print(dataFrame)

   EmpID   Name  Age           City
0    101   John   25       New York
1    102   Jane   30  San Francisco
2    103    Bob   35    Los Angeles
3    104  Alice   40        Chicago

### Insert Column\nAdding new column at specific position

In [ ]:
# Add Country
country = ['USA', 'USA', 'USA', 'USA']
dataFrame.insert(4, 'Country', country)
print(dataFrame)

   EmpID   Name  Age           City Country
0    101   John   25       New York     USA
1    102   Jane   30  San Francisco     USA
2    103    Bob   35    Los Angeles     USA
3    104  Alice   40        Chicago     USA

# **Update the Data**
using **`loc()`**

In [20]:
sample_data = {
    'Name': [
        'Alice', 'Bob', 'Charlie', 'David', 'Eve',
        'Frank', 'Grace', 'Hank', 'Ivy', 'Jack',
        'Kathy', 'Leo', 'Mia', 'Noah', 'Olivia',
        'Paul', 'Quinn', 'Rose', 'Sam', 'Tina'
    ],
    'Age': [
        25, 30, 35, 28, 22, 40, 31, 29, 24, 33,
        27, 38, 26, 32, 23, 45, 29, 34, 21, 36
    ],
    'City': [
        'New York', 'San Francisco', 'Los Angeles', 'Chicago', 'Miami',
        'Seattle', 'Austin', 'Boston', 'Denver', 'Atlanta',
        'Portland', 'Dallas', 'Phoenix', 'San Diego', 'Philadelphia',
        'Las Vegas', 'Houston', 'Detroit', 'Minneapolis', 'Nashville'
    ],
    'Salary': [
        50000, 60000, 70000, 55000, 48000,
        85000, 62000, 58000, 52000, 67000,
        54000, 78000, 51000, 64000, 49000,
        95000, 59000, 72000, 47000, 81000
    ]
}
DF = pd.DataFrame(sample_data)
print(DF.head())

      Name  Age           City  Salary
0    Alice   25       New York   50000
1      Bob   30  San Francisco   60000
2  Charlie   35    Los Angeles   70000
3    David   28        Chicago   55000
4      Eve   22          Miami   48000

### Preview Data\nViewing first/last rows of the dataset

In [21]:
# Update the value of Row 3
DF.loc[3,"Salary"] = 80000
print(DF.head())

      Name  Age           City  Salary
0    Alice   25       New York   50000
1      Bob   30  San Francisco   60000
2  Charlie   35    Los Angeles   70000
3    David   28        Chicago   80000
4      Eve   22          Miami   48000

### Preview Data\nViewing first/last rows of the dataset

In [22]:
# Update the value of Row 4
DF.loc[4,"Salary"] = 90000
print(DF.head())

      Name  Age           City  Salary
0    Alice   25       New York   50000
1      Bob   30  San Francisco   60000
2  Charlie   35    Los Angeles   70000
3    David   28        Chicago   80000
4      Eve   22          Miami   90000